Repository: Blezz-tech/nushell-translate-docs-ru
Catalog: nushell-translate-docs-ru-level2.tmx
Source language: en_us
Languages: ru_ru

source: # This outputs the list [orange blue purple].
ru_ru: # Это выводит список [оранжевый синий фиолетовый].

source: (Not so) Advanced
ru_ru: (Не очень) Продвинутый

source: ::: tip Changing how tables are displayed Nu will try to expands all table's structure by default.
ru_ru: ::: tip Изменение способа отображения таблиц По умолчанию Nu попытается расширить структуру всех таблиц.

source: 3rd Party Prompts - How to configure 3rd party prompts
ru_ru: Сторонние подсказки - Как настроить сторонние подсказки (3rd party prompts)

source: Aliases - How to alias commands
ru_ru: Псевдонимы - Как назначать псевдонимы командам

source: Coloring and Theming - How to change the colors and themes in Nushell
ru_ru: Раскраска и оформлениеg - Как изменить цвета и темы в Nushell

source: Coming from Bash - Guide for those coming to Nushell from Bash
ru_ru: Пришедшие из Bash - Руководство для тех, кто пришел в Nushell из Bash

source: Coming from Bash shows how some patterns typical for Bash, or POSIX shells in general, can be mapped to Nushell.
ru_ru: Переход из Bash показывает, как некоторые паттерны, характерные для Bash или POSIX-оболочек в целом, могут быть отображены на Nushell.

source: Command Reference - List of all Nushell's commands
ru_ru: Справочник команд - Список всех команд Nushell'а

source: Configuration - How to configure Nushell
ru_ru: Конфигурация - Как настроить Nushell

source: Control flow - Working with the control flow commands
ru_ru: Поток управления - Работа с командами потока управления

source: Creating Modules
ru_ru: Создание модулей

source: Creating your own errors - Creating your own error messages
ru_ru: Создание собственных ошибок - Создание собственных ошибок

source: Custom commands - Creating your own commands
ru_ru: Пользовательские команды - Создание собственных команд

source: Directory Stack - Working with multiple locations
ru_ru: Стек каталогов - Работа в нескольких местах

source: Environment - Working with environment variables
ru_ru: Переменные окружения - Работа с переменными окружения

source: Hooks - Adding code snippets to be run automatically
ru_ru: Хуки - Добавление фрагментов кода для автоматического выполнения

source: How Nushell Code Gets Run explains what happens when you run Nushell source code.
ru_ru: Как выполняется код Nushell объясняет, что происходит, когда вы запускаете исходный код Nushell.

source: Installation - Installing Nushell
ru_ru: Установка - Установка Nushell

source: Introduction - Getting started
ru_ru: Введение - Начало работы

source: Loading data - Loading data and using it
ru_ru: Загрузка данных - Загрузка и использование данных

source: Metadata - An explanation of Nu's metadata system
ru_ru: Метаданные - Объяснение системы метаданных Nu

source: Modules - Creating and using your own modules
ru_ru: Модули - Создание и использование собственных модулей

source: Nushell map from functional languages - Guide to show how Nushell compares with Clojure, Tablecloth (OCaml / Elm) and Haskell
ru_ru: Таблица сравнения Nushell и функциональных языков - Руководство, показывающее, как Nushell сравнивается с Clojure, Tablecloth (OCaml / Elm) и Haskell

source: Nushell map from imperative languages - Guide to show how Nushell compares with Python, Kotlin, C++, C#, and Rust
ru_ru: Таблица сравнения Nushell и императивных языков - Руководство, показывающее, как Nushell сравнивается с Python, Kotlin, C++, C#, и Rust

source: Nushell map from shells/DSL - Guide to show how Nushell compares with SQL, LINQ, PowerShell, and Bash
ru_ru: Таблица сравнения Nushell и shells/DSL - Руководство, показывающее, как Nushell сравнивается с SQL, LINQ, PowerShell, и Bash

source: Nushell operator map - Guide to show how Nushell operators compare with those in general purpose programming languages
ru_ru: Nushell и оператор map - Руководство, показывающее, как операторы Nushell соотносятся с операторами в языках программирования общего назначения

source: Operators - Operators supported by Nushell
ru_ru: Операторы - Операторы, поддерживаемые Nushell

source: Parallelism - Running your code in parallel
ru_ru: Параллелизм - Параллельное выполнение кода

source: Pipelines - How the pipeline works
ru_ru: Конвейеры - Как работают конвейеры

source: Plugins - Enhancing Nushell with more features using plugins
ru_ru: Плагины - Расширение возможностей Nushell с помощью плагинов

source: Regular Expressions - Guide to use regex
ru_ru: Регулярные выражения - Руководство по использованию regex

source: Running External (System) Commands - Running external commands with a naming conflict
ru_ru: Выполнение внешних (системных) команд - Запуск внешних команд с конфликтом имен

source: Scripts - Creating your own scripts
ru_ru: Скрипты - Создание собственных скриптов

source: Stdout, stderr, and exit codes - Working with stdout, stderr, and exit codes
ru_ru: Stdout, stderr и коды выхода - Работа с stdout, stderr и кодами выхода

source: Strings - Strings, escape characters, and string interpolation
ru_ru: Строки - Строки, управляющие символы и интерполяция строк

source: Thinking in Nu - Thinking in Nushell
ru_ru: Мышление в Nushell - Мышление в Nushell

source: Types of data - Types of data in Nushell
ru_ru: Типы данных - Типы данных в Nushell

source: Using Modules
ru_ru: Использование модулей

source: Variables - Working with variables
ru_ru: Переменные - Работа с переменными

source: Working with lists - Working with Nu lists
ru_ru: Работа со списками - Работа со списками Nu

source: Working with tables - Working with Nu tables
ru_ru: Работа с таблицами - Работа с таблицами Nu

source: A constant variable is an immutable variable that can be fully evaluated at parse-time.
ru_ru: Константная переменная - это неизменяемая переменная, которая может быть полностью оценена во время парсинга.

source: A list is an ordered collection of values.
ru_ru: Список - это упорядоченная коллекция значений.

source: A mutable variable is allowed to change its value by assignment.
ru_ru: Изменяемая переменная может изменять свое значение путем присваивания.

source: A separate comparison is made specifically for operators.
ru_ru: Отдельное сравнение проводится специально для операторов.

source: Additional custom commands
ru_ru: Дополнительные пользовательские команды

source: Aliases
ru_ru: Псевдонимы

source: Almost anything can be a plugin as long as it communicates with Nushell in a protocol that Nushell understands.
ru_ru: Почти все может быть плагином, если оно взаимодействует с Nushell по протоколу, который понимает Nushell.

source: Also, many bare words have special meaning in nu, and so will not be interpreted as a string:
ru_ru: Кроме того, многие "голые" слова имеют особое значение в языке nu, и поэтому не будут интерпретироваться как строки:

source: An immutable variable cannot change its value after declaration.
ru_ru: Неизменяемая переменная не может изменить свое значение после объявления.

source: And even other modules (a.k.a., submodules)
ru_ru: И даже другие модули (они же подмодули).

source: And from the beginning of a list,
ru_ru: И с самого начала списка,

source: And now, let's update the edition to point at the next edition we hope to support:
ru_ru: А теперь давайте обновим `edition`, чтобы оно указывало на следующее издание, которое мы надеемся поддерживать:

source: Besides the built-in commands, Nushell has a standard library.
ru_ru: Помимо встроенных команд, в Nushell есть стандартная библиотека.

source: But rather than trying to be a jack of all trades, Nu focuses its energy on doing a few things well:
ru_ru: Но вместо того, чтобы пытаться быть универсальным специалистом, Nu сосредоточила свою энергию на том, чтобы делать несколько вещей хорошо:

source: Changes in Nu are functional changes, meaning that they work on values themselves rather than trying to cause a permanent change.
ru_ru: Изменения в Ню - это функциональные изменения, то есть они работают над самими значениями, а не пытаются вызвать необратимые изменения.

source: Coming to Nu
ru_ru: Переход в Nu

source: Constants
ru_ru: Константы

source: Contributing to this book does not require any special skills aside from a basic familiarity with Markdown.
ru_ru: Работа над этой книгой не требует никаких специальных навыков, кроме базового знакомства с Markdown.

source: Design Notes
ru_ru: Примечания к дизайну

source: Discovering bugs with reproduction steps and filing GitHub issues for them is a valuable help, too!
ru_ru: Обнаружение ошибок с помощью шагов воспроизведения и создание запросов в GitHub об этих ошибках является ценной помощью!

source: Each list value will be converted to a separate row with a single column:
ru_ru: Каждое значение списка будет будет преобразовано в отдельную строку с одним столбцом:

source: Environment variables
ru_ru: Переменные среды

source: Escape characters let you quickly add in a character that would otherwise be hard to type.
ru_ru: Управляющие символы позволяют быстро добавить символ, который иначе было бы трудно набрать.

source: Finally you could also use string interpolation, but that is complex enough that it is covered in its own subsection below.
ru_ru: Наконец, можно также использовать интерполяцию строк, но это достаточно сложная задача, поэтому она рассматривается в отдельном подразделе ниже.

source: Finally, you can extend Nushell's functionality with plugins.
ru_ru: Наконец, вы можете расширить функциональность Nushell с помощью плагинов.

source: Finally, you can use the GitHub discussions or file GitHub issues.
ru_ru: Наконец, вы можете воспользоваться обсуждениями на GitHub или создать проблемы на GitHub.

source: For example
ru_ru: Например

source: For example, we could also have sorted the above using the "name", "accessed", or "modified" columns.
ru_ru: Например, мы могли бы отсортировать все вышеперечисленное по столбцам "name", "accessed" или "modified".

source: For example, we could write the text hello followed by a new line and then world, using escape characters and a double-quoted string:
ru_ru: Например, мы можем написать текст "Привет", за которым следует новая строка, а затем "мир", используя при этом управляющие символы и двойные кавычки:

source: For example:
ru_ru: Например:

source: For more complex strings, Nushell also offers double-quoted strings.
ru_ru: Для более сложных строк Nushell также предлагает строки с двойными кавычками.

source: Furthermore, you can consider translating parts of it to your language.
ru_ru: Кроме того, вы можете перевести некоторые его части на свой язык.

source: Getting Started
ru_ru: Начало работы

source: Hello, and welcome to the Nushell project.
ru_ru: Здравствуйте, добро пожаловать в проект Nushell.

source: Here's an example of all the options in action:
ru_ru: Вот пример всех вариантов в действии:

source: Here's an example of using a substring:
ru_ru: Вот пример использования подстроки:

source: Here's the text for hello world as a single-quoted string:
ru_ru: Вот текст Привет мир! в виде строки с одинарными кавычками:

source: Hooks
ru_ru: Хуки

source: However, you do not have to be a Rust programmer to help.
ru_ru: Однако вам не обязательно быть программистом Rust, чтобы помочь.

source: If it still is confusing, note that appending one more row will make the table render as expected:
ru_ru: Если это все еще вызывает недоумение, обратите внимание, что добавление еще одной строки приведет к тому, что таблица будет отображаться как положено:

source: If the column names are not identical then additionally columns and values will be created as necessary:
ru_ru: Если имена столбцов не совпадают, то при необходимости будут созданы дополнительные столбцы и значения:

source: If there is some topic that you find confusing and hard to understand, let us know.
ru_ru: Если какая-то тема кажется вам запутанной и трудной для понимания, сообщите нам.

source: If you are familiar with other shells or programming languages, you might find this chapter useful to get up to speed.
ru_ru: Если вы знакомы с другими оболочками или языками программирования, эта глава может оказаться полезной для вас.

source: If you know some web development, you can contribute to improving this website or the Nana project.
ru_ru: Если вы разбираетесь в веб-разработке, вы можете внести свой вклад в улучшение этого сайта или проекта Nana.

source: If you want to add something to the beginning of each string closures are a good option:
ru_ru: Если вы хотите добавить что-то в начало каждоой строки, то застежки - отличный вариант:

source: If you want to know more, check the crate documentation: "regex".
ru_ru: Если вы хотите узнать больше, ознакомьтесь с документацией по пакету: "regex".

source: In Nu, rather than editing in place, each of the commands in the section will return a new table in the pipeline.
ru_ru: В Nu, вместо того чтобы редактировать на месте, каждая из команд в этом разделе будет возвращать новую таблицу в конвейер.

source: In addition to selecting data from a table, we can also update what the table has.
ru_ru: Помимо выборки данных из таблицы, мы также можем обновлять данные в таблице.

source: In case you want to remove items from list, there are many ways.
ru_ru: Если вы хотите удалить элементы из списка, есть много способов.

source: In particular, they cannot contain these characters:
ru_ru: В частности, они не могут содержать эти символы:

source: In this case, remember: rows have numbers, columns have names.
ru_ru: В этом случае помните: строки имеют номера, столбцы - имена.

source: It can be used with lists as follows:
ru_ru: Его можно использовать со списками следующим образом:

source: It explains how Nushell is in many ways closer to classic compiled languages, like C or Rust, than to other shells and dynamic languages and hopefully clears some confusion that stems from that.
ru_ru: В ней объясняется, что Nushell во многих отношениях ближе к классическим компилируемым языкам, таким как C или Rust, чем к другим оболочкам и динамическим языкам, и, надеюсь, устраняется некоторая путаница, возникающая из-за этого.

source: It is broken into multiple crates that can be used as independent libraries in your own project, if you wish so.
ru_ru: Он разбит на несколько ящиков, которые при желании можно использовать в качестве независимых библиотек в собственном проекте.

source: It might be a good candidate for a page here.
ru_ru: Это может быть хорошим кандидатом на страницу здесь.

source: Let's add a column called "next_edition" with the value 2021:
ru_ru: Добавим столбец "next_edition" со значением 2021:

source: Let's add a third table:
ru_ru: Добавим третью таблицу:

source: Let's get started!
ru_ru: Давайте начнем!

source: Let's look at a few other commands for selecting data.
ru_ru: Рассмотрим несколько других команд для выборки данных.

source: Let's look at an example:
ru_ru: Давайте рассмотрим пример:

source: Let's say we wanted to sort our table by the size of the file:
ru_ru: Допустим, мы хотим отсортировать нашу таблицу по размеру файла:

source: Let's say, for example, we wanted to only get a list of the names of the files.
ru_ru: Допустим, мы хотим получить только список имен файлов.

source: Let's see if we can spell out the difference between these two commands to make it clear:
ru_ru: Давайте попробуем объяснить разницу между этими двумя командами, чтобы все стало понятно:

source: Let's skip the first two of the 5 rows we returned above:
ru_ru: Давайте пропустим первые две из 5 строк, которые мы вернули выше:

source: Like many programming languages, Nushell supports writing and using modules as a way to organize code more efficiently.
ru_ru: Как и многие другие языки программирования, Nushell поддерживает написание и использование модулей как способ более эффективной организации кода.

source: Like other shell languages (but unlike most other programming languages) strings consisting of a single 'word' can also be written without any quotes:
ru_ru: Как и в других языках оболочки (но в отличие от большинства других языков программирования), строки, состоящие из одного "слова", могут быть записаны без кавычек:

source: Make sure to check the Dataframes documentation if you want to process large data efficiently directly in your shell.
ru_ru: Обязательно ознакомьтесь с документацией Dataframes, если вы хотите эффективно обрабатывать большие данные прямо в оболочке.

source: Many users will start off using modules written by others, then progress to writing their own.
ru_ru: Многие пользователи начинают с использования модулей, написанных другими, а затем переходят к написанию своих собственных.

source: Modules
ru_ru: Модули

source: Modules can be thought of a "containers" that hold various definitions, including:
ru_ru: Модули можно рассматривать как «контейнеры», в которых хранятся различные определения, в том числе:

source: More complex string use cases also need a new form of string: string interpolation.
ru_ru: Более сложные случаи использования строк также нуждаются в новой форме строк: интерполяции строк.

source: Next, let's say we want to only look at the 5 smallest files in this directory:
ru_ru: Далее, допустим, мы хотим просмотреть только 5 самых маленьких файлов в этой директории:

source: Note that file redirections are scoped to an expression and apply to all external commands in the expression.
ru_ru: Обратите внимание, что перенаправления файлов ограничены выражением и применяются ко всем внешним командам в выражении.

source: Notice that if we open the original file, the contents have stayed the same:
ru_ru: Обратите внимание, что если мы откроем исходный файл, то его содержимое останется неизменным:

source: Nu comes with a number of commands for working with tables to make it convenient to find what you're looking for, and for narrowing down the data to just what you need.
ru_ru: В Nu входит ряд команд для работы с таблицами, позволяющих легко найти то, что вы ищете, и сузить круг данных до нужных вам.

source: Nu takes cues from a lot of familiar territory: traditional shells like bash, object based shells like PowerShell, gradually typed languages like TypeScript, functional programming, systems programming, and more.
ru_ru: Nu берет пример со многих знакомых мест: традиционные оболочки, такие как bash, объектно-ориентированные оболочки, такие как PowerShell, постепенно типизируемые языки, такие как TypeScript, функциональное программирование, системное программирование и многое другое.

source: Nushell currently supports the following escape characters:
ru_ru: В настоящее время Nushell поддерживает следующие управляющие символы:

source: Nushell operates on structured data.
ru_ru: Nushell работает с структурированными данными.

source: One of the common ways of seeing data in Nu is through a table.
ru_ru: Один из распространенных способов представления данных в Nu - это таблица.

source: Padding adds characters to string until it's a certain length.
ru_ru: Вставка добавляет символы в строку до определенной длины.

source: Rather, only the last command in the expression is affected.
ru_ru: Скорее, затрагивается только последняя команда в выражении.

source: Regular Expressions
ru_ru: Регулярные выражения

source: Regular expressions in Nushell's commands are handled by the rust-lang/regex crate.
ru_ru: Регулярные выражения в Nushell обрабатываются пакетом rust-lang/regex.

source: Running System (External) Commands
ru_ru: Выполнение системных (внешних) команд

source: Shadowing means that they are redeclared and their initial value cannot be used anymore within the same scope.
ru_ru: Затенение означает, что они повторно объявляются и их начальное значение больше не может быть использовано в той же области видимости.

source: Similar comparisons are made for some other shells and domain-specific languages, imperative languages, and functional languages.
ru_ru: Аналогичные сравнения проводятся для некоторых других оболочек и доменно-специфических языков, императивных языков и функциональных языков.

source: Similarly, Coming from CMD.EXE shows how built-in commands in the Windows Command Prompt can be mapped to Nushell.
ru_ru: Аналогично, Вход из CMD.EXE показывает, как встроенные команды в командной строке Windows могут быть сопоставлены с Nushell.

source: Since Nushell evolves fast, this book is in a constant need of updating.
ru_ru: Поскольку Nushell быстро развивается, эта книга постоянно нуждается в обновлении.

source: Single-quoted strings don't do anything to the text they're given, making them ideal for holding a wide range of text data.
ru_ru: Строки с одинарными кавычками ничего не делают с текстом, который им передается, поэтому они идеально подходят для хранения широкого спектра текстовых данных.

source: So far, we've worked with tables by trimming the table down to only what we need.
ru_ru: До сих пор мы работали с таблицами, обрезая их только до того, что нам нужно.

source: So, while bare strings are useful for informal command line usage, when programming more formally in nu, you should generally use quotes.
ru_ru: Поэтому, хотя голые строки полезны для неформального использования командной строки, при более формальном программировании на языке nu следует использовать кавычки.

source: Sometimes we may want to go a step further and only look at the values in the cells themselves rather than taking a whole column.
ru_ru: Иногда мы можем захотеть пойти дальше и просмотреть только значения в самих ячейках, а не брать весь столбец.

source: String interpolation combines the results together, giving you a new string.
ru_ru: Интерполяция строк объединяет результаты и дает новую строку.

source: Substrings are slices of a string.
ru_ru: Подстроки - это фрагменты строки.

source: Table of Contents
ru_ru: # Содержание

source: Thanks to Nushell's strict scoping rules, it is very easy to iterate over collections in parallel which can help you speed up long-running scripts by just typing a few characters.
ru_ru: Благодаря строгим правилам определения объемов в Nushell очень легко параллельно выполнять итерацию над коллекциями, что может помочь вам ускорить долго выполняющиеся скрипты, просто набрав несколько символов.

source: The Nushell project consists of multiple different repositories and subprojects.
ru_ru: Проект Nushell состоит из множества различных репозиториев и подпроектов.

source: The book is split into chapters which are further broken down into sections.
ru_ru: Книга разделена на главы, которые далее разбиты на разделы.

source: The following example gets all the colors whose names end in "e".
ru_ru: Следующий пример позволяет получить все цвета, названия которых заканчиваются на "e".

source: The goal of this project is to take the Unix philosophy of shells, where pipes connect simple commands together, and bring it to the modern style of development.
ru_ru: Цель этого проекта - взять философию оболочек Unix, где простые команды соединяются с помощью конвейеров, и адаптировать ее к современному стилю разработки.

source: The next sections will give you a short tour of Nushell by example (including how to get help from within Nushell) and show you how to move around your file system.
ru_ru: В следующих разделах мы расскажем вам краткий экскурс по Nushell в примерах (включая получение помощи из Nushell) и покажем, как перемещаться по вашей файловой системе.

source: The simplest string in Nushell is the single-quoted string.
ru_ru: Самая простая строка в Nushell - это строка с одинарной кавычкой.

source: The topics are not necessary for a basic usage, but reading them will help you understand how Nushell works and why.
ru_ru: Эти темы не являются необходимыми для базового использования, но их прочтение поможет вам понять, как работает Nushell и почему.
